In [1]:
import pandas as pd
import numpy as np
columns = []
tableData = []

In [2]:
student_registration = pd.read_csv("data/studentRegistration.csv")

In [3]:
student_registration.head(5)

,code_module,code_presentation,id_student,date_registration,date_unregistration
0,AAA,2013J,11391,-159.0,NaN
1,AAA,2013J,28400,-53.0,NaN
2,AAA,2013J,30268,-92.0,12.0
3,AAA,2013J,31604,-52.0,NaN
4,AAA,2013J,32885,-176.0,NaN

In [4]:
studentRegistration = student_registration[(student_registration.code_module == 'AAA') & (student_registration.code_presentation == '2013J')]
studentId = studentRegistration[['id_student', 'date_registration', 'date_unregistration']]
columns = ['id_student', 'date_registration', 'date_unregistration']
tableData=studentId
tableData.head(5)

   id_student  date_registration  date_unregistration
0       11391             -159.0                  NaN
1       28400              -53.0                  NaN
2       30268              -92.0                 12.0
3       31604              -52.0                  NaN
4       32885             -176.0                  NaN

In [5]:
tableData.count()

id_student             383
date_registration      383
date_unregistration     60
dtype: int64

In [6]:
assesments = pd.read_csv("data/assessments.csv")
assesments = assesments[(assesments.code_module == 'AAA') & (assesments.code_presentation == '2013J')]
assesmentIdColumn = 'id_assessment'
assesmentIds = assesments[assesmentIdColumn]
assesmentIds

0    1752
1    1753
2    1754
3    1755
4    1756
5    1757
Name: id_assessment, dtype: int64

In [7]:
for i in range(len(assesmentIds)): 
    columns.append(str(assesmentIds[i]))
columns.append('total_sum_click')
columns.append('total_Day_Of_Click')

In [8]:
featureTable = pd.DataFrame(data =tableData, columns = columns)
featureTable.head(5)

,id_student,date_registration,date_unregistration,1752,1753,1754,1755,1756,1757,total_sum_click,total_Day_Of_Click
0,11391,-159.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,28400,-53.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,30268,-92.0,12.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,31604,-52.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,32885,-176.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [9]:
student_assessments = pd.read_csv("data/studentAssessment.csv")
student_assessments.head(5)
studentAssesments = student_assessments[student_assessments.id_student == 11391]
studentAssesments
# for index, row in studentAssesments.iterrows():
#     if(row.id_assessment == 1754):
#         studentAssesments.at[index, 'id_student'] = 50

      id_assessment  id_student  date_submitted  is_banked  score
0              1752       11391              18          0   78.0
501            1753       11391              53          0   85.0
842            1754       11391             115          0   80.0
1032           1755       11391             164          0   85.0
1457           1756       11391             212          0   82.0

In [21]:
student_vle = pd.read_csv("data/studentVle.csv")
studentVle = student_vle[(student_vle.code_module == 'AAA') & (student_vle.code_presentation == '2013J')]
for index, row in featureTable.iterrows():
    studentVle = student_vle[student_vle.id_student == row.id_student]
    featureTable.at[index,'total_sum_click'] = studentVle.sum_click.sum()
    featureTable.at[index,'total_Day_Of_Click'] = studentVle.date.count()
    studentAssesments = student_assessments[student_assessments.id_student == row.id_student]
    for index1, row1 in studentAssesments.iterrows():
        if(row1.id_assessment  == 1752):
            featureTable.at[index, '1752'] = 1
        elif(row1.id_assessment  == 1753):
            featureTable.at[index, '1753'] = 1
        elif(row1.id_assessment  == 1754):
            featureTable.at[index, '1754'] = 1
        elif(row1.id_assessment  == 1755):
            featureTable.at[index, '1755'] = 1
        elif(row1.id_assessment  == 1756):
            featureTable.at[index, '1756'] = 1 
        elif(row1.id_assessment  == 1757):
            featureTable.at[index, '1757'] = 1
featureTable.fillna(0, inplace=True)
featureTable.head(5)

,id_student,date_registration,date_unregistration,1752,1753,1754,1755,1756,1757,total_sum_click,total_Day_Of_Click
0,11391,-159.0,0.0,1.0,1.0,1.0,1.0,1.0,0.0,934.0,196.0
1,28400,-53.0,0.0,1.0,1.0,1.0,1.0,1.0,0.0,1435.0,430.0
2,30268,-92.0,12.0,0.0,0.0,0.0,0.0,0.0,0.0,281.0,76.0
3,31604,-52.0,0.0,1.0,1.0,1.0,1.0,1.0,0.0,2158.0,663.0
4,32885,-176.0,0.0,1.0,1.0,1.0,1.0,1.0,0.0,1034.0,352.0